'''
다음과 같은 형태의 배열을
[a1,a2,a3...,an,b1,b2...bn]
다음과 같은 형태로 바꾸시오
[a1,b1,a2,b2.....an,bn]
'''
"""
========================================================================
과제1. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 사용 X
      - input_list = ['a1','a2','a3','a4','a5','a6','b1','b2','b3','b4','b5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""
lst = ['a1','a2','a3','a4','a5','a6','b1','b2','b3','b4','b5','b6']
cnt = 1
for i in range(len(lst)):
    if (i+1) % 2 == 1:
        lst[i] = 'a'+str(cnt)
    else:
        lst[i] = 'b'+str(cnt)
        cnt += 1
print(lst)

"""
========================================================================
과제2. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 필수적 사용
      - input_list = ['a1','a2','a3','a4','a5','a6','b1','b2','b3','b4','b5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""

input_list = ['a1','a2','a3','a4','a5','a6','b1','b2','b3','b4','b5','b6']

input_list.sort(key = lambda x:x[1]) #key를 튜플의 두번째 값으로 지정
print(input_list)

"""
========================================================================
과제3. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 사용 X
      - input_list = ['b1','a2','b3','a4','b5','a6','a1','b2','b4','a3','a5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""

lst = ['b1','a2','b3','a4','b5','a6','a1','b2','b4','a3','a5','b6']
cnt = 1 #a, b 뒤에 1부터 시작하는 숫자가 존재하니 cnt를 1로 지정
for i in range(len(lst)): #리스트의 개수만큼 반복
    if (i+1) % 2 == 1: #만약 홀수번째라면 a를 먼저 넣는다.
        lst[i] = 'a'+str(cnt)
    else: #만약 짝수번째라면 b를 먼저 넣는다.
        lst[i] = 'b'+str(cnt)
        cnt += 1 #그 후 cnt에 1를 추가. if절에서 홀수번째라면 같은 숫자의 b가 필요하므로 if에는 cnt를 넣지 않음

print(lst)


"""
========================================================================
과제4. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 필수적 사용
      - input_list = ['b1','a2','b3','a4','b5','a6','a1','b2','b4','a3','a5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""

input_list = ['b1','a2','b3','a4','b5','a6','a1','b2','b4','a3','a5','b6']

input_list = sorted(input_list, key=lambda x:x[1])
print(input_list)
