'''
다음과 같은 형태의 배열을

[a1,a2,a3...,an,b1,b2...bn]
다음과 같은 형태로 바꾸시오

[a1,b1,a2,b2.....an,bn]
'''
"""
========================================================================
과제1. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 사용 X
      - input_list = ['a1','a2','a3','a4','a5','a6','b1','b2','b3','b4','b5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""
input_list = input().split(', ')

# 마지막 요소인 b6에서 6만 추출해서 a와 b가 각각 몇 개씩 있는지 확인
# 개수에 따라 a+숫자, b+숫자를 순서대로 리스트에 저장
num = input_list[-1]    # b6
num = num[-1]           # 6

# a와 b에 i를 추가한 형태를 순서대로 출력
for i in range(1, int(num)+1):
    if i == int(num):
        print('a%d,' % i, 'b%d' % i)  # 마지막 수에 도달하면 쉼표 없는 형태로 출력
    else:
        print('a%d,' % i, 'b%d,' % i, end=' ')

# a1, a2, a3, a4, a5, a6, b1, b2, b3, b4, b5, b6

# print('a'+str(i)+', '+'b'+str(i)+', ')

"""
========================================================================
과제2. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 필수적 사용
      - input_list = ['a1','a2','a3','a4','a5','a6','b1','b2','b3','b4','b5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""
input_list = input().split(', ')

a = []
b = []

for i in input_list:          # a 리스트와 b 리스트 생성
    if 'a' in i:
        a.append(i)
    else:
        b.append(i)

str_list = list(map(lambda x, y: x+' '+y, a, b))      # ['a1 b1', 'a2 b2', ...]
result = ' '.join(s for s in str_list)                # 'a1 b1 a2 b2 ...'
result.split(' ')                                     # ['a1', 'b1', 'a2', 'b2', ...]

# a1, a2, a3, a4, a5, a6, b1, b2, b3, b4, b5, b6

"""
========================================================================
과제3. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 사용 X
      - input_list = ['b1','a2','b3','a4','b5','a6','a1','b2','b4','a3','a5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""
input_list = input().split(', ')

# 모든 문자열의 숫자 부분을 [-1]로 추출해 리스트를 만들고 리스트 정렬한 후 마지막 숫자 사용
num_list = []
for i in input_list:
      num_candidate = int(i[-1])
      num_list.append(num_candidate)
num_list.sort()
num = num_list[-1]

# 나머지는 과제1과 동일
for i in range(1, int(num)+1):
    if i == int(num):
        print('a%d,' % i, 'b%d' % i)  # 마지막 수에 도달하면 쉼표 없는 형태로 출력
    else:
        print('a%d,' % i, 'b%d,' % i, end=' ')

# b1, a2, b3, a4, b5, a6, a1, b2, b4, a3, a5, b6


"""
========================================================================
과제4. 아래와 같은 입력값을 넣을 경우 출력값을 도출하는 알고리즘을 구성하시오.  
      - 조건1. 람다식 필수적 사용
      - input_list = ['b1','a2','b3','a4','b5','a6','a1','b2','b4','a3','a5','b6']
      - 출력값 = ['a1','b1','a2','b2','a3','b3','a4','b4','a5','b5','a6','b6']
========================================================================
"""
input_list = input().split(', ')

a = []
b = []

for i in input_list:
    if 'a' in i:
        a.append(i)
    else:
        b.append(i)

a.sort()
b.sort()

str_list = list(map(lambda x, y: x+' '+y, a, b))
result = ' '.join(s for s in str_list)
result.split(' ')

# b1, a2, b3, a4, b5, a6, a1, b2, b4, a3, a5, b6